{
  "projs": [
    {
      "id": 1,
      "projColor": "#d4d0cd",
      "backImage": "url('../../constructor.jpg')",
      "title": {
        "url": "https://plnup.com/configurator/",
        "title": "3D-Configurator",
        "created": "2022"
      },
      "topImage": null,
      "textA": "This was a quick challenge to prove the possibility of having a high-performance and photorealistic configurator for the web. It took around 12 days for the whole thing. From taking some pictures as a base for 3d modeling to deploying the code",
      "iFrame": {
        "url": "https://plnup.com/configurator/",
        "height": [400, 600],
        "minWidth": 950
      },
      "textB": "The configurator itself has nothing special but there are two solutions that make this app different from the others:",
      "expand": {
        "title": ["read more...", "read less..."],
        "text": "1_ Environment based on the real pictures (I used pictures of the room we are living in at the moment). The better-looking place would look more attractive. This particular room changes its height based on the height of the closet. \n 2_ Different method of camera control (not three-js OrbitControls) which avoids the user going to unwanted spots (inside of geometries such as walls or bed in this example) and at the same time keeps the variety and freedom to move the camera in all directions. As the result, you keep everything you need the focus avoiding surprises. \n I used a little PHP doing some back-end so you can save your projects and load them after via hash keys in the link. \n Also, you can download a 3d model of what you made, and each time you press the save button a list of an object will appear in the console just to show the source from which the object is made. \n There is no problem to create a list of details for real production based on the geometries dimensions used in the scene as they are 100% accurate. \n I made everything on plain js and threejs just for learning purposes. I didn't take care of the design part. Used standard buttons etc. as the design wasn't the main goal. \n  Here is a link with a hash to check an example of a made closet: ",
        "link": {
          "url": "https://plnup.com/configurator/#demo",
          "title": "3D-configurator/Demo"
        }
      },
      "link": null
    },
    {
      "id": 2,
      "projColor": "#f8f8f8",
      "backImage": null,
      "title": {
        "url": "https://plnup.com/uv.html",
        "title": "UV Mapper",
        "created": "2020"
      },
      "topImage": "./uv mapper.jpg",
      "textA": "Based on the UV map, this plugin can place a user selected image on a specific area of the target image or video (image sequence). \n Similar functionality can be found in compositing packages such as: After Effects, Nuke, Fusion, etc. \n You can try it bellow. Just select an image to place on the mug:",
      "iFrame": {
        "url": "https://pixel-park.github.io/uv-mapping-cpu/",
        "height": [440, 640],
        "minWidth": 300
      },
      "textB": null,
      "expand": {
        "title": ["specifications...", "hide"],
        "text": "Limitations: \n 1_ The code is written on canvas, which processes images only in the 8-bit range. \n 2_ I have not found an API to write (encode) from an image sequence. So at the moment video can be played only as an image sequence. \n To make a downloadable video (like mp4), we need to use the server-side. \n  \n Advantages: \n 1 _ I find some solutions to get smoother and more clear images from 8-bit UV maps. \n Thus, the default rendering algorithm (standard-fast) gives exactly the same result as in professional compositing programs, while you can achieve better results with the other 3 rendering settings presented above.(comparing 8-bit images) \n  \n 2_ Although multiple layers are required to get a satisfactory result in compositing programs, here just one UV layer produces the result with shadow and masks (opacity), as I have placed mask and shadow layers in the blue color of the UV map. \n For more examples, click at the plugin name  ",
        "link": {
          "url": "https://plnup.com/uv.html",
          "title": "  UV Mapper"
        }
      },
      "link": null
    },
    {
      "id": 3,
      "projColor": "#f1ece8",
      "backImage": "url(../../link-logo-B.jpg)",
      "title": {
        "url": "https://plnup.com/",
        "title": "PLNUP",
        "created": "2019"
      },
      "topImage": null,
      "textA": "A platform where you can upload your design / architectural projects. It allows you to combine up to 3 images, links (as icons), and additional comments on a single screen. You can create an unlimited number of such screens (plans). The idea, design, and development of this project are mine. I worked on it for about 1.5 months. In development, I used HTML, CSS, JS, and PHP for back-end",
      "iFrame": {
        "url": "https://plnup.com/viewer.html",
        "height": [500, 800],
        "minWidth": 650
      },
      "textB": "The platform has two parts: ",
      "expand": {
        "title": ["show more...", "show less..."],
        "text": "1_Viewer that loads projects using a .JSON file which allows dynamically:  \n  Compare \"before /after\" state of photos with dimensions and other information on it \n  Interact with links that are attached to image elements as icons  \n Get comments on plans, if any \n Scale and pan the image for a more detailed view \n  \n 2_The project editor that creates a \"js object\" based on uploaded images and other information entered by the user. \n Each time you click on the \"save\" button, the editor writes the finished object to a \".json\" file. \n  \n  press \"create a project\" on the link to check the editor ",
        "link": {
          "url": "https://plnup.com/",
          "title": " PLNUP-Main page"
        }
      },
      "link": null
    },
    {
      "id": 4,
      "projColor": "",
      "backImage": "url(../../easysip.jpg)",
      "title": {
        "url": "https://plnup.com/easysip/",
        "title": "EasySip - straw holder",
        "created": "2017"
      },
      "topImage": null,
      "textA": "My first experience creating sites. It was for my own startup which never launched due to the drinking straw ban all over the world. So the idea of the product, web design, and development are mine. At the moment I hosted this site on a different address so the home links will redirect you to my previous project page.",
      "iFrame": null,
      "textB": null,
      "expand": null,
      "link": null
    }
  ]
}
